Autodesk.Navisworks.Api.EulerAngleResult
Represents Euler angles returned from a method

Autodesk.Navisworks.Api.EulerAngleResult.#ctor
Constructor for a Euler angle result.

Autodesk.Navisworks.Api.EulerAngleResult.X
'X' Euler angle

Autodesk.Navisworks.Api.EulerAngleResult.Y
'Y' Euler angle

Autodesk.Navisworks.Api.EulerAngleResult.Z
'Z' Euler angle